scripts/artillery-test.yml
## Artillery Load Testing Configuration
##
## Updated to use Cookie-based authentication.
## The login scenario extracts only the token values from Set-Cookie headers
## (accessToken and refreshToken) via regex, discarding HttpOnly / Path / etc.
## Subsequent requests inject a properly formatted Cookie header:
##   Cookie: "accessToken={{ accessToken }}; refreshToken={{ refreshToken }}"
##
## Alternative to k6 for Node.js based load testing
##
## Install: npm install -g artillery
## Run: artillery run scripts/artillery-test.yml
## Report: artillery run scripts/artillery-test.yml --output report.json
##         artillery report report.json

config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:5001' }}"
  phases:
    # Warm up
    - duration: 30
      arrivalRate: 5
      name: 'Warm up'

    # Ramp up
    - duration: 60
      arrivalRate: 10
      rampTo: 30
      name: 'Ramp up'

    # Sustained load
    - duration: 120
      arrivalRate: 30
      name: 'Sustained load'

    # Spike test
    - duration: 30
      arrivalRate: 100
      name: 'Spike test'

    # Cool down
    - duration: 30
      arrivalRate: 5
      name: 'Cool down'

  defaults:
    headers:
      Content-Type: 'application/json'

  # Plugins
  plugins:
    expect: {}
    metrics-by-endpoint: {}

  # Thresholds
  ensure:
    p99: 1000 # 99th percentile under 1s
    p95: 500 # 95th percentile under 500ms
    maxErrorRate: 5 # Max 5% error rate

  variables:
    testEmail: 'artillery_{{ $randomNumber(1000, 9999) }}@test.com'
    testPassword: 'TestPassword123!'

scenarios:
  # Health check scenario
  - name: 'Health Check'
    weight: 30
    flow:
      - get:
          url: '/health'
          expect:
            - statusCode: 200
            - hasProperty: 'status'

  # Browse pages scenario
  - name: 'Browse Pages'
    weight: 40
    flow:
      - get:
          url: '/api/pages'
          capture:
            - json: '$[0].id'
              as: 'pageId'
          expect:
            - statusCode: 200

      - think: 1

      - get:
          url: '/api/pages/{{ pageId }}'
          ifTrue: 'pageId'
          expect:
            - statusCode: 200

  # Search scenario
  - name: 'Search'
    weight: 20
    flow:
      - get:
          url: '/api/search?q=test&limit=10'
          expect:
            - statusCode: 200

  # Authenticated CRUD scenario
  - name: 'Authenticated CRUD'
    weight: 10
    flow:
      # Register (ignore 409 if user already exists)
      - post:
          url: '/api/auth/register'
          json:
            name: 'Artillery Test'
            email: '{{ testEmail }}'
            password: '{{ testPassword }}'

      # Login — extract token values from Set-Cookie headers via regex
      - post:
          url: '/api/auth/login'
          json:
            email: '{{ testEmail }}'
            password: '{{ testPassword }}'
          capture:
            # Capture only the token value, discarding HttpOnly / Path / SameSite etc.
            - header: 'set-cookie'
              regexp: 'accessToken=([^;]+)'
              group: 1
              as: 'accessToken'
            - header: 'set-cookie'
              regexp: 'refreshToken=([^;]+)'
              group: 1
              as: 'refreshToken'
          expect:
            - statusCode: 200

      - think: 1

      # Create page — inject clean token cookies manually
      - post:
          url: '/api/pages'
          headers:
            Cookie: 'accessToken={{ accessToken }}; refreshToken={{ refreshToken }}'
          json:
            title: 'Artillery Test Page {{ $timestamp }}'
            content: 'Load testing content'
            tags: ['artillery', 'test']
          capture:
            - json: '$.id'
              as: 'newPageId'
          expect:
            - statusCode: 201

      - think: 2

      # Update page
      - patch:
          url: '/api/pages/{{ newPageId }}'
          headers:
            Cookie: 'accessToken={{ accessToken }}; refreshToken={{ refreshToken }}'
          json:
            content: 'Updated at {{ $timestamp }}'
          expect:
            - statusCode: 200

      - think: 1
      # Delete page
      - delete:
          url: '/api/pages/{{ newPageId }}'
          headers:
            Cookie: 'accessToken={{ accessToken }}; refreshToken={{ refreshToken }}'
          expect:
            - statusCode:
                - 200
                - 204